emacs/.config/emacs/pre-early-init.el
;;; pre-early-init.el --- Pre Early Init -*- no-byte-compile: t; lexical-binding: t; -*-
;; WARNING: This file was generated by tangling a literate program.

; (setq debug-on-error t)
(setq minimal-emacs-var-dir (expand-file-name "var/" minimal-emacs-user-directory))
(setq package-user-dir (expand-file-name "elpa" minimal-emacs-var-dir))
(setq user-emacs-directory minimal-emacs-var-dir)

;; because we are going to be using elpaca
(setq package-enable-at-startup nil)

;; By default, minimal-emacs-package-initialize-and-refresh is set to t, which
;; makes minimal-emacs.d call the built-in package manager. Since Elpaca will
;; replace the package manager, there is no need to call it.
(setq minimal-emacs-package-initialize-and-refresh nil)
;; (setq minimal-emacs-gc-cons-threshold (* 64 1024 1024))
